; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?arm - arm ?crate - crate)
    (empty-arm ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?arm ?crate)     
        (not (empty-arm ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l23_p23_c23_g23_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(empty-arm left)
	(empty-arm right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate food crate16)
	(content-crate food crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(content-crate medicine crate22)
	(content-crate medicine crate23)
	(person-at person1 loc20)
	(person-at person2 loc19)
	(person-at person3 loc7)
	(person-at person4 loc6)
	(person-at person5 loc13)
	(person-at person6 loc14)
	(person-at person7 loc3)
	(person-at person8 loc15)
	(person-at person9 loc18)
	(person-at person10 loc17)
	(person-at person11 loc7)
	(person-at person12 loc7)
	(person-at person13 loc1)
	(person-at person14 loc8)
	(person-at person15 loc13)
	(person-at person16 loc2)
	(person-at person17 loc21)
	(person-at person18 loc21)
	(person-at person19 loc10)
	(person-at person20 loc5)
	(person-at person21 loc18)
	(person-at person22 loc23)
	(person-at person23 loc4)
	(person-need person1 food)
	(person-need person1 medicine)
	(person-need person3 food)
	(person-need person4 food)
	(person-need person6 food)
	(person-need person6 medicine)
	(person-need person7 food)
	(person-need person8 food)
	(person-need person9 food)
	(person-need person11 food)
	(person-need person12 food)
	(person-need person13 food)
	(person-need person13 medicine)
	(person-need person14 food)
	(person-need person15 food)
	(person-need person16 food)
	(person-need person16 medicine)
	(person-need person18 food)
	(person-need person19 food)
	(person-need person20 medicine)
	(person-need person21 food)
	(person-need person22 medicine)
	(person-need person23 food)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person1 medicine)
	(has-content-person person3 food)
	(has-content-person person4 food)
	(has-content-person person6 food)
	(has-content-person person6 medicine)
	(has-content-person person7 food)
	(has-content-person person8 food)
	(has-content-person person9 food)
	(has-content-person person11 food)
	(has-content-person person12 food)
	(has-content-person person13 food)
	(has-content-person person13 medicine)
	(has-content-person person14 food)
	(has-content-person person15 food)
	(has-content-person person16 food)
	(has-content-person person16 medicine)
	(has-content-person person18 food)
	(has-content-person person19 food)
	(has-content-person person20 medicine)
	(has-content-person person21 food)
	(has-content-person person22 medicine)
	(has-content-person person23 food)
))
)

; plan
1. (pick-up-crate crate23 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate23 depot)
   added: (has-crate-drone-arm right crate23)
   goals met: 1 of 24
2. (pick-up-crate crate17 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate17 depot)
   added: (has-crate-drone-arm left crate17)
   goals met: 1 of 24
3. (drone-move depot loc23 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc23)
   goals met: 0 of 24
4. (drop-crate loc23 person22 crate23 right medicine drone1)
   deleted: (has-crate-drone-arm right crate23)
   added: (has-content-person person22 medicine) (empty-arm right)
   goals met: 1 of 24
5. (drone-move loc23 depot drone1)
   deleted: (drone-at drone1 loc23)
   added: (drone-at drone1 depot)
   goals met: 2 of 24
6. (pick-up-crate crate22 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate22 depot)
   added: (has-crate-drone-arm right crate22)
   goals met: 2 of 24
7. (drone-move depot loc21 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc21)
   goals met: 1 of 24
8. (drop-crate loc21 person18 crate17 left food drone1)
   deleted: (has-crate-drone-arm left crate17)
   added: (has-content-person person18 food) (empty-arm left)
   goals met: 2 of 24
9. (drone-move loc21 depot drone1)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 depot)
   goals met: 3 of 24
10. (pick-up-crate crate16 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate16 depot)
   added: (has-crate-drone-arm left crate16)
   goals met: 3 of 24
11. (drone-move depot loc15 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc15)
   goals met: 2 of 24
12. (drop-crate loc15 person8 crate16 left food drone1)
   deleted: (has-crate-drone-arm left crate16)
   added: (has-content-person person8 food) (empty-arm left)
   goals met: 3 of 24
13. (drone-move loc15 depot drone1)
   deleted: (drone-at drone1 loc15)
   added: (drone-at drone1 depot)
   goals met: 4 of 24
14. (pick-up-crate crate15 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate15 depot)
   added: (has-crate-drone-arm left crate15)
   goals met: 4 of 24
15. (drone-move depot loc13 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc13)
   goals met: 3 of 24
16. (drop-crate loc13 person15 crate15 left food drone1)
   deleted: (has-crate-drone-arm left crate15)
   added: (has-content-person person15 food) (empty-arm left)
   goals met: 4 of 24
17. (drone-move loc13 depot drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 depot)
   goals met: 5 of 24
18. (pick-up-crate crate14 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate14 depot)
   added: (has-crate-drone-arm left crate14)
   goals met: 5 of 24
19. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 4 of 24
20. (drop-crate loc10 person19 crate14 left food drone1)
   deleted: (has-crate-drone-arm left crate14)
   added: (has-content-person person19 food) (empty-arm left)
   goals met: 5 of 24
21. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 6 of 24
22. (pick-up-crate crate13 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate13 depot)
   added: (has-crate-drone-arm left crate13)
   goals met: 6 of 24
23. (drone-move depot loc8 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc8)
   goals met: 5 of 24
24. (drop-crate loc8 person14 crate13 left food drone1)
   deleted: (has-crate-drone-arm left crate13)
   added: (has-content-person person14 food) (empty-arm left)
   goals met: 6 of 24
25. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 7 of 24
26. (pick-up-crate crate12 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate12 depot)
   added: (has-crate-drone-arm left crate12)
   goals met: 7 of 24
27. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 6 of 24
28. (drop-crate loc6 person4 crate12 left food drone1)
   deleted: (has-crate-drone-arm left crate12)
   added: (has-content-person person4 food) (empty-arm left)
   goals met: 7 of 24
29. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 8 of 24
30. (pick-up-crate crate11 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate11 depot)
   added: (has-crate-drone-arm left crate11)
   goals met: 8 of 24
31. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 7 of 24
32. (drop-crate loc5 person20 crate22 right medicine drone1)
   deleted: (has-crate-drone-arm right crate22)
   added: (has-content-person person20 medicine) (empty-arm right)
   goals met: 8 of 24
33. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 9 of 24
34. (pick-up-crate crate21 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate21 depot)
   added: (has-crate-drone-arm right crate21)
   goals met: 9 of 24
35. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 8 of 24
36. (drop-crate loc4 person23 crate11 left food drone1)
   deleted: (has-crate-drone-arm left crate11)
   added: (has-content-person person23 food) (empty-arm left)
   goals met: 9 of 24
37. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 10 of 24
38. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate10 depot)
   added: (has-crate-drone-arm left crate10)
   goals met: 10 of 24
39. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 9 of 24
40. (drop-crate loc3 person7 crate10 left food drone1)
   deleted: (has-crate-drone-arm left crate10)
   added: (has-content-person person7 food) (empty-arm left)
   goals met: 10 of 24
41. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 11 of 24
42. (pick-up-crate crate9 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate9 depot)
   added: (has-crate-drone-arm left crate9)
   goals met: 11 of 24
43. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 10 of 24
44. (drop-crate loc20 person1 crate9 left food drone1)
   deleted: (has-crate-drone-arm left crate9)
   added: (has-content-person person1 food) (empty-arm left)
   goals met: 11 of 24
45. (drop-crate loc20 person1 crate21 right medicine drone1)
   deleted: (has-crate-drone-arm right crate21)
   added: (has-content-person person1 medicine) (empty-arm right)
   goals met: 12 of 24
46. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 13 of 24
47. (pick-up-crate crate20 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate20 depot)
   added: (has-crate-drone-arm right crate20)
   goals met: 13 of 24
48. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate8 depot)
   added: (has-crate-drone-arm left crate8)
   goals met: 13 of 24
49. (drone-move depot loc18 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc18)
   goals met: 12 of 24
50. (drop-crate loc18 person9 crate8 left food drone1)
   deleted: (has-crate-drone-arm left crate8)
   added: (has-content-person person9 food) (empty-arm left)
   goals met: 13 of 24
51. (drone-move loc18 depot drone1)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 depot)
   goals met: 14 of 24
52. (pick-up-crate crate7 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate7 depot)
   added: (has-crate-drone-arm left crate7)
   goals met: 14 of 24
53. (drone-move depot loc18 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc18)
   goals met: 13 of 24
54. (drop-crate loc18 person21 crate7 left food drone1)
   deleted: (has-crate-drone-arm left crate7)
   added: (has-content-person person21 food) (empty-arm left)
   goals met: 14 of 24
55. (drone-move loc18 depot drone1)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 depot)
   goals met: 15 of 24
56. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate6 depot)
   added: (has-crate-drone-arm left crate6)
   goals met: 15 of 24
57. (drone-move depot loc14 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc14)
   goals met: 14 of 24
58. (drop-crate loc14 person6 crate6 left food drone1)
   deleted: (has-crate-drone-arm left crate6)
   added: (has-content-person person6 food) (empty-arm left)
   goals met: 15 of 24
59. (drop-crate loc14 person6 crate20 right medicine drone1)
   deleted: (has-crate-drone-arm right crate20)
   added: (has-content-person person6 medicine) (empty-arm right)
   goals met: 16 of 24
60. (drone-move loc14 depot drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 depot)
   goals met: 17 of 24
61. (pick-up-crate crate19 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate19 depot)
   added: (has-crate-drone-arm right crate19)
   goals met: 17 of 24
62. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate5 depot)
   added: (has-crate-drone-arm left crate5)
   goals met: 17 of 24
63. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 16 of 24
64. (drop-crate loc7 person3 crate5 left food drone1)
   deleted: (has-crate-drone-arm left crate5)
   added: (has-content-person person3 food) (empty-arm left)
   goals met: 17 of 24
65. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 18 of 24
66. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate4 depot)
   added: (has-crate-drone-arm left crate4)
   goals met: 18 of 24
67. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 17 of 24
68. (drop-crate loc7 person11 crate4 left food drone1)
   deleted: (has-crate-drone-arm left crate4)
   added: (has-content-person person11 food) (empty-arm left)
   goals met: 18 of 24
69. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 19 of 24
70. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate3 depot)
   added: (has-crate-drone-arm left crate3)
   goals met: 19 of 24
71. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 18 of 24
72. (drop-crate loc7 person12 crate3 left food drone1)
   deleted: (has-crate-drone-arm left crate3)
   added: (has-content-person person12 food) (empty-arm left)
   goals met: 19 of 24
73. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 20 of 24
74. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate2 depot)
   added: (has-crate-drone-arm left crate2)
   goals met: 20 of 24
75. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 19 of 24
76. (drop-crate loc2 person16 crate2 left food drone1)
   deleted: (has-crate-drone-arm left crate2)
   added: (has-content-person person16 food) (empty-arm left)
   goals met: 20 of 24
77. (drop-crate loc2 person16 crate19 right medicine drone1)
   deleted: (has-crate-drone-arm right crate19)
   added: (has-content-person person16 medicine) (empty-arm right)
   goals met: 21 of 24
78. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 22 of 24
79. (pick-up-crate crate18 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate18 depot)
   added: (has-crate-drone-arm right crate18)
   goals met: 22 of 24
80. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate1 depot)
   added: (has-crate-drone-arm left crate1)
   goals met: 22 of 24
81. (drone-move depot loc1 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc1)
   goals met: 21 of 24
82. (drop-crate loc1 person13 crate1 left food drone1)
   deleted: (has-crate-drone-arm left crate1)
   added: (has-content-person person13 food) (empty-arm left)
   goals met: 22 of 24
83. (drop-crate loc1 person13 crate18 right medicine drone1)
   deleted: (has-crate-drone-arm right crate18)
   added: (has-content-person person13 medicine) (empty-arm right)
   goals met: 23 of 24
84. (drone-move loc1 depot drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 depot)
   goals met: 24 of 24
